app/controllers/index_controller.rb

  def thanks
    page_count = SnailMail.page_count (session[:fp_url])
    m = SnailMail.new(:page_count => page_count, :file_url => session[:fp_url],
    :email => params[:email], :sender_address => params[:sender_address],
    :recipient_address => params[:recipient_address])

    m.save
---
INSERT INTO "mails" ("created_at", "email", "file_content_type", "file_file_name", "file_file_size", "file_updated_at", "file_url", "page_count", "recipient_address", "sender_address", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "snail_mails" ("created_at", "email", "file_content_type", "file_file_name", "file_file_size", "file_updated_at", "file_url", "page_count", "recipient_address", "sender_address", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)